IRP/src/Catalogs/BillOfMaterials/BillOfMaterials.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>BillOfMaterials</name>
 <attributes>
  <name>Item</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </attributes>
 <attributes>
  <name>Unit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <attributes>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </attributes>
 <attributes>
  <name>Active</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>BusinessUnit</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.BillOfMaterialsTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>ExtraCostAmountByRatio</name>
  <type>
   <types>DefinedType.typePercent</types>
  </type>
 </attributes>
 <attributes>
  <name>ExtraCostTaxAmountByRatio</name>
  <type>
   <types>DefinedType.typePercent</types>
  </type>
 </attributes>
 <attributes>
  <name>DurationOfProduction</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>5</precision>
    <scale>2</scale>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ExtraDirectCostAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <attributes>
  <name>ExtraDirectCostTaxAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <tabularSections>
  <name>Content</name>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Unit</name>
   <type>
    <types>CatalogRef.Units</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>BillOfMaterials</name>
   <type>
    <types>CatalogRef.BillOfMaterials</types>
   </type>
  </attributes>
  <attributes>
   <name>ExpenseType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/BillOfMaterials/ManagerModule.bsl
Function GetBillOfMaterialsByItemKey(ItemKey, BusinessUnit = Undefined) Export
	Query = New Query();
	Query.Text = 
		"SELECT
		|	ItemKeys.DefaultBillOfMaterials AS Ref
		|FROM
		|	Catalog.ItemKeys AS ItemKeys
		|WHERE
		|	ItemKeys.Ref = &ItemKey
		|	AND NOT ItemKeys.DefaultBillOfMaterials.DeletionMark
		|	AND ItemKeys.DefaultBillOfMaterials.Active
		|	and case
		|		when &Filter_BusinessUnit
		|			then ItemKeys.DefaultBillOfMaterials.BusinessUnit = &BusinessUnit
		|		else true
		|	end
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT TOP 2
		|	Table.Ref
		|FROM
		|	Catalog.BillOfMaterials AS Table
		|WHERE
		|	Table.ItemKey = &ItemKey
		|	AND NOT Table.DeletionMark
		|	AND Table.Active
		|	and case
		|		when &Filter_BusinessUnit
		|			then Table.BusinessUnit = &BusinessUnit
		|		else true
		|	end";
	Query.SetParameter("ItemKey", ItemKey);
	Query.SetParameter("BusinessUnit", BusinessUnit);
	Query.SetParameter("Filter_BusinessUnit", BusinessUnit <> Undefined);
	
	QueryResults = Query.ExecuteBatch();
	DefaultRef = QueryResults[0].Unload();
	If DefaultRef.Count() Then
		Return DefaultRef[0].Ref;
	EndIf;
	
	Selection = QueryResults[1].Select();
	If Selection.Count() = 1 Then
		Selection.Next();
		Return Selection.Ref;
	EndIf;
	Return EmptyRef();
EndFunction
